Tekla Open API Reference for Tekla Structures 2025
StringConverter Class
 The StringConverter class converts types to and from the string datatype.
Inheritance Hierarchy
System.Object
 System.ComponentModel.TypeConverter
 Tekla.Structures.Datatype.StringConverter
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class StringConverter : TypeConverter
Public Class StringConverter
	Inherits TypeConverter
The StringConverter type exposes the following members.
Constructors
Name | Description
StringConverter
Initializes a new instance of the StringConverter class
Top
Methods
Name | Description
CanConvertFrom
 Checks whether the conversion can be made from the source type to the string datatype.
 (Overrides TypeConverter.CanConvertFrom(ITypeDescriptorContext, Type).)
CanConvertTo
 Checks whether the conversion can be made from the string datatype to the destination type.
 (Overrides TypeConverter.CanConvertTo(ITypeDescriptorContext, Type).)
ConvertFrom
 Converts an object from the given culture to the Tekla.Structures.Datatype.String type.
 (Overrides TypeConverter.ConvertFrom(ITypeDescriptorContext, CultureInfo, Object).)
ConvertTo
 Converts an object from the string datatype to the given destination type.
 (Overrides TypeConverter.ConvertTo(ITypeDescriptorContext, CultureInfo, Object, Type).)
Top
See Also
Reference
Tekla.Structures.Datatype Namespace